/* automatically generated by rust-bindgen */

pub const FIDO_ERR_SUCCESS: u32 = 0;
pub const FIDO_ERR_INVALID_COMMAND: u32 = 1;
pub const FIDO_ERR_INVALID_PARAMETER: u32 = 2;
pub const FIDO_ERR_INVALID_LENGTH: u32 = 3;
pub const FIDO_ERR_INVALID_SEQ: u32 = 4;
pub const FIDO_ERR_TIMEOUT: u32 = 5;
pub const FIDO_ERR_CHANNEL_BUSY: u32 = 6;
pub const FIDO_ERR_LOCK_REQUIRED: u32 = 10;
pub const FIDO_ERR_INVALID_CHANNEL: u32 = 11;
pub const FIDO_ERR_CBOR_UNEXPECTED_TYPE: u32 = 17;
pub const FIDO_ERR_INVALID_CBOR: u32 = 18;
pub const FIDO_ERR_MISSING_PARAMETER: u32 = 20;
pub const FIDO_ERR_LIMIT_EXCEEDED: u32 = 21;
pub const FIDO_ERR_UNSUPPORTED_EXTENSION: u32 = 22;
pub const FIDO_ERR_CREDENTIAL_EXCLUDED: u32 = 25;
pub const FIDO_ERR_PROCESSING: u32 = 33;
pub const FIDO_ERR_INVALID_CREDENTIAL: u32 = 34;
pub const FIDO_ERR_USER_ACTION_PENDING: u32 = 35;
pub const FIDO_ERR_OPERATION_PENDING: u32 = 36;
pub const FIDO_ERR_NO_OPERATIONS: u32 = 37;
pub const FIDO_ERR_UNSUPPORTED_ALGORITHM: u32 = 38;
pub const FIDO_ERR_OPERATION_DENIED: u32 = 39;
pub const FIDO_ERR_KEY_STORE_FULL: u32 = 40;
pub const FIDO_ERR_NOT_BUSY: u32 = 41;
pub const FIDO_ERR_NO_OPERATION_PENDING: u32 = 42;
pub const FIDO_ERR_UNSUPPORTED_OPTION: u32 = 43;
pub const FIDO_ERR_INVALID_OPTION: u32 = 44;
pub const FIDO_ERR_KEEPALIVE_CANCEL: u32 = 45;
pub const FIDO_ERR_NO_CREDENTIALS: u32 = 46;
pub const FIDO_ERR_USER_ACTION_TIMEOUT: u32 = 47;
pub const FIDO_ERR_NOT_ALLOWED: u32 = 48;
pub const FIDO_ERR_PIN_INVALID: u32 = 49;
pub const FIDO_ERR_PIN_BLOCKED: u32 = 50;
pub const FIDO_ERR_PIN_AUTH_INVALID: u32 = 51;
pub const FIDO_ERR_PIN_AUTH_BLOCKED: u32 = 52;
pub const FIDO_ERR_PIN_NOT_SET: u32 = 53;
pub const FIDO_ERR_PIN_REQUIRED: u32 = 54;
pub const FIDO_ERR_PIN_POLICY_VIOLATION: u32 = 55;
pub const FIDO_ERR_PIN_TOKEN_EXPIRED: u32 = 56;
pub const FIDO_ERR_REQUEST_TOO_LARGE: u32 = 57;
pub const FIDO_ERR_ACTION_TIMEOUT: u32 = 58;
pub const FIDO_ERR_UP_REQUIRED: u32 = 59;
pub const FIDO_ERR_ERR_OTHER: u32 = 127;
pub const FIDO_ERR_SPEC_LAST: u32 = 223;
pub const FIDO_OK: u32 = 0;
pub const FIDO_ERR_TX: i32 = -1;
pub const FIDO_ERR_RX: i32 = -2;
pub const FIDO_ERR_RX_NOT_CBOR: i32 = -3;
pub const FIDO_ERR_RX_INVALID_CBOR: i32 = -4;
pub const FIDO_ERR_INVALID_PARAM: i32 = -5;
pub const FIDO_ERR_INVALID_SIG: i32 = -6;
pub const FIDO_ERR_INVALID_ARGUMENT: i32 = -7;
pub const FIDO_ERR_USER_PRESENCE_REQUIRED: i32 = -8;
pub const FIDO_ERR_INTERNAL: i32 = -9;
pub const FIDO_RANDOM_DEV: &'static [u8; 13usize] = b"/dev/urandom\0";
pub const FIDO_CAP_WINK: u32 = 1;
pub const FIDO_CAP_CBOR: u32 = 4;
pub const FIDO_CAP_NMSG: u32 = 8;
pub const FIDO_EXT_HMAC_SECRET: u32 = 1;
pub const FIDO_DEBUG: u32 = 1;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type fido_dev_io_open_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void,
>;
pub type fido_dev_io_close_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
pub type fido_dev_io_read_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_uchar,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type fido_dev_io_write_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_uchar,
        arg3: usize,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fido_dev_io {
    pub open: fido_dev_io_open_t,
    pub close: fido_dev_io_close_t,
    pub read: fido_dev_io_read_t,
    pub write: fido_dev_io_write_t,
}
#[test]
fn bindgen_test_layout_fido_dev_io() {
    assert_eq!(
        ::std::mem::size_of::<fido_dev_io>(),
        32usize,
        concat!("Size of: ", stringify!(fido_dev_io))
    );
    assert_eq!(
        ::std::mem::align_of::<fido_dev_io>(),
        8usize,
        concat!("Alignment of ", stringify!(fido_dev_io))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fido_dev_io>())).open as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fido_dev_io),
            "::",
            stringify!(open)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fido_dev_io>())).close as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fido_dev_io),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fido_dev_io>())).read as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fido_dev_io),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fido_dev_io>())).write as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fido_dev_io),
            "::",
            stringify!(write)
        )
    );
}
pub type fido_dev_io_t = fido_dev_io;
pub const fido_opt_t_FIDO_OPT_OMIT: fido_opt_t = 0;
pub const fido_opt_t_FIDO_OPT_FALSE: fido_opt_t = 1;
pub const fido_opt_t_FIDO_OPT_TRUE: fido_opt_t = 2;
pub type fido_opt_t = u32;
extern "C" {
    pub fn fido_strerr(arg1: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fido_assert {
    _unused: [u8; 0],
}
pub type fido_assert_t = fido_assert;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fido_cbor_info {
    _unused: [u8; 0],
}
pub type fido_cbor_info_t = fido_cbor_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fido_cred {
    _unused: [u8; 0],
}
pub type fido_cred_t = fido_cred;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fido_dev {
    _unused: [u8; 0],
}
pub type fido_dev_t = fido_dev;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fido_dev_info {
    _unused: [u8; 0],
}
pub type fido_dev_info_t = fido_dev_info;
extern "C" {
    pub fn fido_assert_new() -> *mut fido_assert_t;
}
extern "C" {
    pub fn fido_cred_new() -> *mut fido_cred_t;
}
extern "C" {
    pub fn fido_dev_new() -> *mut fido_dev_t;
}
extern "C" {
    pub fn fido_dev_info_new(arg1: usize) -> *mut fido_dev_info_t;
}
extern "C" {
    pub fn fido_cbor_info_new() -> *mut fido_cbor_info_t;
}
extern "C" {
    pub fn fido_assert_free(arg1: *mut *mut fido_assert_t);
}
extern "C" {
    pub fn fido_cbor_info_free(arg1: *mut *mut fido_cbor_info_t);
}
extern "C" {
    pub fn fido_cred_free(arg1: *mut *mut fido_cred_t);
}
extern "C" {
    pub fn fido_dev_force_fido2(arg1: *mut fido_dev_t);
}
extern "C" {
    pub fn fido_dev_force_u2f(arg1: *mut fido_dev_t);
}
extern "C" {
    pub fn fido_dev_free(arg1: *mut *mut fido_dev_t);
}
extern "C" {
    pub fn fido_dev_info_free(arg1: *mut *mut fido_dev_info_t, arg2: usize);
}
extern "C" {
    pub fn fido_init(arg1: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fido_assert_authdata_ptr(
        arg1: *const fido_assert_t,
        arg2: usize,
    ) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_assert_clientdata_hash_ptr(
        arg1: *const fido_assert_t,
    ) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_assert_hmac_secret_ptr(
        arg1: *const fido_assert_t,
        arg2: usize,
    ) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_assert_id_ptr(
        arg1: *const fido_assert_t,
        arg2: usize,
    ) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_assert_sig_ptr(
        arg1: *const fido_assert_t,
        arg2: usize,
    ) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_assert_user_id_ptr(
        arg1: *const fido_assert_t,
        arg2: usize,
    ) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_cbor_info_extensions_ptr(
        arg1: *const fido_cbor_info_t,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_cbor_info_options_name_ptr(
        arg1: *const fido_cbor_info_t,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_cbor_info_versions_ptr(
        arg1: *const fido_cbor_info_t,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_cbor_info_options_value_ptr(arg1: *const fido_cbor_info_t) -> *const bool;
}
extern "C" {
    pub fn fido_assert_rp_id(arg1: *const fido_assert_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_assert_user_display_name(
        arg1: *const fido_assert_t,
        arg2: usize,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_assert_user_icon(
        arg1: *const fido_assert_t,
        arg2: usize,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_assert_user_name(
        arg1: *const fido_assert_t,
        arg2: usize,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_cred_display_name(arg1: *const fido_cred_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_cred_fmt(arg1: *const fido_cred_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_cred_rp_id(arg1: *const fido_cred_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_cred_rp_name(arg1: *const fido_cred_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_cred_user_name(arg1: *const fido_cred_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_dev_info_manufacturer_string(
        arg1: *const fido_dev_info_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_dev_info_path(arg1: *const fido_dev_info_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_dev_info_product_string(
        arg1: *const fido_dev_info_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fido_dev_info_ptr(arg1: *const fido_dev_info_t, arg2: usize) -> *const fido_dev_info_t;
}
extern "C" {
    pub fn fido_cbor_info_protocols_ptr(arg1: *const fido_cbor_info_t) -> *const u8;
}
extern "C" {
    pub fn fido_cbor_info_aaguid_ptr(
        arg1: *const fido_cbor_info_t,
    ) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_cred_authdata_ptr(arg1: *const fido_cred_t) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_cred_clientdata_hash_ptr(
        arg1: *const fido_cred_t,
    ) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_cred_id_ptr(arg1: *const fido_cred_t) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_cred_user_id_ptr(arg1: *const fido_cred_t) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_cred_pubkey_ptr(arg1: *const fido_cred_t) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_cred_sig_ptr(arg1: *const fido_cred_t) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_cred_x5c_ptr(arg1: *const fido_cred_t) -> *const ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn fido_assert_allow_cred(
        arg1: *mut fido_assert_t,
        arg2: *const ::std::os::raw::c_uchar,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_set_authdata(
        arg1: *mut fido_assert_t,
        arg2: usize,
        arg3: *const ::std::os::raw::c_uchar,
        arg4: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_set_clientdata_hash(
        arg1: *mut fido_assert_t,
        arg2: *const ::std::os::raw::c_uchar,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_set_count(arg1: *mut fido_assert_t, arg2: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_set_extensions(
        arg1: *mut fido_assert_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_set_hmac_salt(
        arg1: *mut fido_assert_t,
        arg2: *const ::std::os::raw::c_uchar,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_set_options(
        arg1: *mut fido_assert_t,
        arg2: bool,
        arg3: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_set_rp(
        arg1: *mut fido_assert_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_set_up(arg1: *mut fido_assert_t, arg2: fido_opt_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_set_uv(arg1: *mut fido_assert_t, arg2: fido_opt_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_set_sig(
        arg1: *mut fido_assert_t,
        arg2: usize,
        arg3: *const ::std::os::raw::c_uchar,
        arg4: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_verify(
        arg1: *const fido_assert_t,
        arg2: usize,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_exclude(
        arg1: *mut fido_cred_t,
        arg2: *const ::std::os::raw::c_uchar,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_authdata(
        arg1: *mut fido_cred_t,
        arg2: *const ::std::os::raw::c_uchar,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_clientdata_hash(
        arg1: *mut fido_cred_t,
        arg2: *const ::std::os::raw::c_uchar,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_extensions(
        arg1: *mut fido_cred_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_fmt(
        arg1: *mut fido_cred_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_options(
        arg1: *mut fido_cred_t,
        arg2: bool,
        arg3: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_rk(arg1: *mut fido_cred_t, arg2: fido_opt_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_rp(
        arg1: *mut fido_cred_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_sig(
        arg1: *mut fido_cred_t,
        arg2: *const ::std::os::raw::c_uchar,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_type(
        arg1: *mut fido_cred_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_uv(arg1: *mut fido_cred_t, arg2: fido_opt_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_type(arg1: *const fido_cred_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_user(
        arg1: *mut fido_cred_t,
        arg2: *const ::std::os::raw::c_uchar,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: *const ::std::os::raw::c_char,
        arg6: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_set_x509(
        arg1: *mut fido_cred_t,
        arg2: *const ::std::os::raw::c_uchar,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_cred_verify(arg1: *const fido_cred_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_dev_close(arg1: *mut fido_dev_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_dev_get_assert(
        arg1: *mut fido_dev_t,
        arg2: *mut fido_assert_t,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_dev_get_cbor_info(
        arg1: *mut fido_dev_t,
        arg2: *mut fido_cbor_info_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_dev_get_retry_count(
        arg1: *mut fido_dev_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_dev_info_manifest(
        arg1: *mut fido_dev_info_t,
        arg2: usize,
        arg3: *mut usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_dev_make_cred(
        arg1: *mut fido_dev_t,
        arg2: *mut fido_cred_t,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_dev_open(
        arg1: *mut fido_dev_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_dev_reset(arg1: *mut fido_dev_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_dev_set_io_functions(
        arg1: *mut fido_dev_t,
        arg2: *const fido_dev_io_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_dev_set_pin(
        arg1: *mut fido_dev_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fido_assert_authdata_len(arg1: *const fido_assert_t, arg2: usize) -> usize;
}
extern "C" {
    pub fn fido_assert_clientdata_hash_len(arg1: *const fido_assert_t) -> usize;
}
extern "C" {
    pub fn fido_assert_count(arg1: *const fido_assert_t) -> usize;
}
extern "C" {
    pub fn fido_assert_hmac_secret_len(arg1: *const fido_assert_t, arg2: usize) -> usize;
}
extern "C" {
    pub fn fido_assert_id_len(arg1: *const fido_assert_t, arg2: usize) -> usize;
}
extern "C" {
    pub fn fido_assert_sig_len(arg1: *const fido_assert_t, arg2: usize) -> usize;
}
extern "C" {
    pub fn fido_assert_user_id_len(arg1: *const fido_assert_t, arg2: usize) -> usize;
}
extern "C" {
    pub fn fido_cbor_info_aaguid_len(arg1: *const fido_cbor_info_t) -> usize;
}
extern "C" {
    pub fn fido_cbor_info_extensions_len(arg1: *const fido_cbor_info_t) -> usize;
}
extern "C" {
    pub fn fido_cbor_info_options_len(arg1: *const fido_cbor_info_t) -> usize;
}
extern "C" {
    pub fn fido_cbor_info_protocols_len(arg1: *const fido_cbor_info_t) -> usize;
}
extern "C" {
    pub fn fido_cbor_info_versions_len(arg1: *const fido_cbor_info_t) -> usize;
}
extern "C" {
    pub fn fido_cred_authdata_len(arg1: *const fido_cred_t) -> usize;
}
extern "C" {
    pub fn fido_cred_clientdata_hash_len(arg1: *const fido_cred_t) -> usize;
}
extern "C" {
    pub fn fido_cred_id_len(arg1: *const fido_cred_t) -> usize;
}
extern "C" {
    pub fn fido_cred_user_id_len(arg1: *const fido_cred_t) -> usize;
}
extern "C" {
    pub fn fido_cred_pubkey_len(arg1: *const fido_cred_t) -> usize;
}
extern "C" {
    pub fn fido_cred_sig_len(arg1: *const fido_cred_t) -> usize;
}
extern "C" {
    pub fn fido_cred_x5c_len(arg1: *const fido_cred_t) -> usize;
}
extern "C" {
    pub fn fido_assert_flags(arg1: *const fido_assert_t, arg2: usize) -> u8;
}
extern "C" {
    pub fn fido_cred_flags(arg1: *const fido_cred_t) -> u8;
}
extern "C" {
    pub fn fido_dev_protocol(arg1: *const fido_dev_t) -> u8;
}
extern "C" {
    pub fn fido_dev_major(arg1: *const fido_dev_t) -> u8;
}
extern "C" {
    pub fn fido_dev_minor(arg1: *const fido_dev_t) -> u8;
}
extern "C" {
    pub fn fido_dev_build(arg1: *const fido_dev_t) -> u8;
}
extern "C" {
    pub fn fido_dev_flags(arg1: *const fido_dev_t) -> u8;
}
extern "C" {
    pub fn fido_dev_info_vendor(arg1: *const fido_dev_info_t) -> i16;
}
extern "C" {
    pub fn fido_dev_info_product(arg1: *const fido_dev_info_t) -> i16;
}
extern "C" {
    pub fn fido_cbor_info_maxmsgsiz(arg1: *const fido_cbor_info_t) -> u64;
}
extern "C" {
    pub fn fido_dev_is_fido2(arg1: *const fido_dev_t) -> bool;
}
